# taking out a single row from a DataFrame

In [36]:
import pandas as pd

import numpy as np
v = np.random.randint(56,90,15)
v1 = np.random.randint(60,90,15)
print(len(v))
data = pd.DataFrame({"name":['bi.bi.kutheja','chandrushekar','darshini','deepak','harsha','manasa','manoj','monstar','pavan',
                             'nisarga','priya','shakthi','spoorthi','yashwanth.R','yashwanth.K.G'],
                     'year1':v,
                     'year2':v1,
                     'year3':v
})

print(data)
print("Value of row 1")
print(data.iloc[7])

15
             name  year1  year2  year3
0   bi.bi.kutheja     80     77     80
1   chandrushekar     88     83     88
2        darshini     64     80     64
3          deepak     66     86     66
4          harsha     84     64     84
5          manasa     61     68     61
6           manoj     60     83     60
7         monstar     86     69     86
8           pavan     58     61     58
9         nisarga     67     61     67
10          priya     86     74     86
11        shakthi     79     82     79
12       spoorthi     67     62     67
13    yashwanth.R     81     69     81
14  yashwanth.K.G     73     86     73
Value of row 1
name     monstar
year1         86
year2         69
year3         86
Name: 7, dtype: object

# aggreagation sum() min() max()

In [37]:
data.agg(['min','max','mean'])

C:\Users\revan\AppData\Local\Temp\ipykernel_7652\530619821.py:1: FutureWarning: ['name'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  data.agg(['min','max','mean'])

               name      year1      year2      year3
min   bi.bi.kutheja  58.000000  61.000000  58.000000
max     yashwanth.R  88.000000  86.000000  88.000000
mean            NaN  73.333333  73.666667  73.333333